#include <iostream>

using namespace std;

/*
За даден опсег [а,b], најдете го збирот на сите непарни позитивни броеви помеѓу а и b.
 На пример, збирот на непарните цели броеви за опсегот [3,9] е 3+5+7+9=24.
Влез
Од стандарден влез се читаат два цели броеви a и b (1 <= a <= b <= 30000),
 кои ги означуваат границите на опсегот [a, b].
 Излез
На стандарден излез, отпечатете го збирот на сите непарни цели броеви помеѓу а и b.
 */

int main() {
    int a,b,sum=0;
    cout<<"Insert two odd numbers: \n";
    cin>>a>>b;
    for(int i=a;i<=b;i++) {
        if(i%2!=0) {
            sum+=i;
        }
    }

   cout<<sum;

    return 0;
}
